# -------------------------------------------------
# 3.注释
"""
多行注释
"""

# -------------------------------------------------
# 1.输出
print("hello world") # 输出
print("hello China",end="\n") # 默认有print("hello world,end = "\n")

print("hello world",end="\t") # 输出 
print("hello China") # \t 是 制表符, 输出四个空格

print("你好","中国") # 多个字符串,用空格作为链接
print("你好","中国",sep=" ") # 默认空格作为链接
print("你好","中国",sep="...") # 可以用其他字符串作为链接

print("520"+"1314") # 连接
print(520+1314) #  不加引号,是加法

print("hello world"*3) # 复制3次

print('I "love" you') # 要成对出现
print("I 'love' you") # 单引号可以嵌套双引号, 双引号可以嵌套单引号
# print("I" love "you")
#   File "/home/yinkangan/Desktop/Vision/task014_Python/__1.py", line 16
#     print("I" love "you")
#           ^^^^^^^^
# SyntaxError: invalid syntax. Perhaps you forgot a comma?

# -------------------------------------------------
# 2.转义字符
print("\yinkangan\Desktop\Vision\task014_Python\__1.py") # 输出乱码, 因为\t等.是转义字符
print("\\yinkangan\\Desktop\\Vision\\task014_Python\\__1.py") # 输出正常, 因为\\是转义字符, 表示\
print(r"\yinkangan\Desktop\Vision\task014_Python\__1.py") # r 表示原始字符串, 不会对\进行转义

# 输出语句两个参数及转义字符:
# end="\n"       # 结束符
# sep=" "        # 分隔符
# +              # 连接
# *              # 复制 

"""
多行注释
"""

'''
单引号也是多行注释
'''
# -------------------------------------------------
# 4.变量与f格式化字符串
a = 5
print(a)
c = a # 变量赋值
print(c)

d,e,f = 7,8,9 # 多个变量赋值
print(d,e,f) 

h=i=j=10 # 多个变量赋相同值
print(h,i,j)

x = 5
y = 2
x,y = y,x # 变量交换
print(x,y)

姓名 = "yinkangan"
年龄 = 18
print(f"我是{姓名}, 今年{年龄}岁, 明年{年龄+1}岁")
print(f'我是{姓名}, 今年{年龄}岁') # 格式化字符串

# -------------------------------------------------
# 5.输入

# print(f"我是{姓名}, 今年{年龄}岁,明年{年龄+1}岁")

姓名 = input("请输入姓名:") # 括号里的字符串是提示信息
年龄 = int(input("请输入年龄: ")) # 所有的输入的是字符串, 要转换为整数类型
print(f"我是{姓名}, 今年{年龄}岁")

# -------------------------------------------------
# 6.数据类型转换
print("1"+"2") # 连接
print(int("1")+int("2")) # 字符串转换为整数类型后, 才能进行加法

#-------------------------------------------------
# 7.检查数据类型
print(type(10)) # <class 'int'>
print(type(10.0)) # <class 'float'>

# -------------------------------------------------
# 8.数学运算符
print(10+20) # 加法
print(10-20) # 减法
print(10*20) # 乘法
print(10/20) # 除法, 结果是浮点数
print(10//20) # 整除, 结果是整数
print(10%20) # 取余, 结果是两个操作数相除的余数
print(2**3) # 幂, 结果是第一个操作数 raised to the power of 第二个操作数
print((10+20)*3) # 小括号可以改变优先级

# -------------------------------------------------
# 9.符合运算符
a += 1

#-------------------------------------------------
# 10.比较运算符
print(10>20) # False
print(10<20) # True
print(10==20) # False
print(10!=20) # True
print(10>=20) # False
print(10<=20) # True

#-------------------------------------------------
# 11.逻辑运算符(返回值为True或False)
# 逻辑与(&&)
print(10<20 and 10<30) # True  非0时返回右边的表达式
# 逻辑或(||)
print(10>20 or 10>30) # False 非0时返回左边的表达式
# 逻辑非(!)
print(not 10>20) # True

#-------------------------------------------------
# 12.优先级顺序

# 1.小括号()
# 2.指数**
# 3.乘法*、除法/、整除//、取余%
# 4.加法+、减法-
# 5.比较运算符
# 6.逻辑运算符