# 字符串

print(type('1'))
print(type("1")) # 单引号和双引号都可以表示字符串,单引号和双引号嵌套时用另一个引号
print("'1'")

print(type("""1"""))  # 三引号可以换行
print(type("""
I love you
Python
           """))

print("\"I\" love you") # 转义字符 \" 表示 "

a = "尹康安"
b = 18
print(f'我是{a},今年{b}岁') # f'{表达式}'

d = int(input("请输入年龄:")) # 输入的内容默认是字符串, 用int()转换为整数
print(f'我是{a},今年{d}岁')

# -------------------------------------------------
# 1.下标,有叫索引
e = "跟,着孙兴华学习Py thon"
print(e[1]) 
print(e[3]) 
print(e[8])
print(e[10]) # 从0开始计数,汉字,符号,空格都占一个位置

# -------------------------------------------------
# 2.切片
# 语法: 序列[开始:结束:步长]
print(e[3:6]) # 从3开始,到6结束,不包括6
print(e[1:]) # 从1开始,到最后
print(e[:5]) # 从0开始,到5结束,不包括5
print(e[:]) # 从0开始,到最后
print(e[1:10:1]) #步长默认是1,表示隔几个取
print(e[1:10:2]) # 从1开始,到10结束,不包括10, 步长是2, 表示隔一个取一个
print(e[::-1]) # 步长是-1, 表示倒序输出
print(e[::-2]) # 步长是-2, 表示倒序输出, 隔一个取一个
print(e[-4:-1]) # 最后为-1,倒着取, 从-4开始,到-1结束,不包括-1

# -------------------------------------------------
# 3.字符串常用方法

# -------------------------------------------------
# find() # 查找子字符串,找到返回下标,否则返回-1
变量名 = "只要地球不爆炸,我相信有一天,全世界都说中国话!中国会成为全世界的风向标!"
print(变量名.find("中国")) # 找到返回先出现的下标
print(变量名.find("中国",23,30)) # 从23开始,到30结束,不包括30, 找到返回先出现的下标
print(变量名.find("美国"))
print(变量名.rfind("中国")) # 从右往左查找, 找到返回先出现的下标

# -------------------------------------------------
# index() # 查找子字符串,和find()方法相同,但找不到就报错
#### print(变量名.index("美国"))
#   File "/home/yinkangan/Desktop/Vision/task014_Python/__2.py", line 54, in <module>
#     print(变量名.index("美国"))
#           ^^^^^^^^^^^^^^^^^^^^
# ValueError: substring not found

# -------------------------------------------------
#count() # 查找子字符串,返回出现的次数
print(变量名.count("中国"))
print(变量名.count("中国",23,30)) # 从23开始,到30结束,不包括30, 找到返回先出现的次数
print(变量名.count("中国",1,2)) # 没有找到返回0

# -------------------------------------------------
# 字符串是不可变类型 # 在修改和删除时,需注意

# 可变类型:列表,字典,集合
# 不可变类型:字符串,整数,浮点数,布尔值
# 所谓可变不可变:数据能直接修改是可变,否则是不可变
# 可变类型:变量值变化,id内存地址不变
# 不可变类型:变量值变化,id内存地址就变化了

# -------------------------------------------------
# replace() # 替换子字符串,返回新的字符串
# 语法: 字符串.replace("旧子字符串","新子字符串",替换次数),替换次数>实际,替换所有
print(变量名.replace("中国","祖国",1)) # 替换第一个"中国"为"美国"
print(id(变量名)) # 查看变量名的id内存地址
print(变量名.replace("中国","祖国")) # 替换所有的"中国"为"美国"
print(id(变量名.replace("中国","祖国"))) # 查看替换后的字符串的id内存地址, 发现id内存地址变化
print(变量名) # 发现这还是之前的字符串, 说明replace()方法是返回新的字符串, 而不是在原字符串上修改
#所以要重新赋值
新变量名 = 变量名.replace("中国","祖国",2)
print(新变量名) # 发现这已经是替换后的字符串了

# -------------------------------------------------
# split() # 分割字符串,返回分割后的列表
# 语法: 字符串.split("分隔符",分割次数)
print(变量名.split("中国")) # 以"中国"为分隔符, 分割字符串, 返回列表
print(变量名.split("中国",1)) # 以"中国"为分隔符, 分割字符串, 返回列表, 最多分割1次

最新变量名 = 变量名.split("中国") # 不要忘记赋值不可变类型
print(最新变量名) # 发现这已经是分割后的列表了

# -------------------------------------------------
# join() # 合并列表,返回新的字符串
# 语法: "分隔符".join(列表)
print("中国".join(最新变量名)) # 以"中国"为分隔符, 合并列表, 返回新的字符串
列表 = ["中","国","最","强"]
print("".join(列表)) # 以空字符串为分隔符, 合并列表, 返回新的字符串
print("_".join(列表))

# -------------------------------------------------
# startswith() # 判断字符串是否以指定子字符串开头,返回True或False
# 语法: 字符串.startswith("子字符串",开始下标,结束下标)
# endswith() # 判断字符串是否以指定子字符串结尾,返回True或False
# 语法: 字符串.endswith("子字符串",开始下标,结束下标)
变量名 = "只要地球不爆炸,我相信有一天,全世界都说中国话!中国会成为全世界的风向标!"
print(变量名.startswith("只要",0,10)) # True
print(变量名.endswith("中国会成为全世界的风向标!",0,10)) # False
print(变量名.endswith("中国会成为全世界的风向标!")) # True
print(变量名.startswith("不要")) # False