/**
 * --------------------------------------------------
 * @b       函数模板
 * --------------------------------------------------
 * 如果要实现一个 add 函数实现多种数据的加法，可以使用函数重载
 * 系统根据参数类型，选择执行哪个 add 函数
 * ​如下：
 */
#include <iostream>

// int add(int a, int c) {
//   return a + c;
// }

// double add(double a, double c) {
//   return a + c;
// }

//------------------------------------------------------------------------------------
// 如此,如果有 10 种类型,要写 10 个 add 重载函数
// 能不能只写一个加法函数,可以适用多种类型呢？
// 可以,该语法叫模板,形式如下
//------------------------------------------------------------------------------------

// 模板函数
template<typename T>      /**< 模板 */
T add(T a, T c) {         /**< 函数 */
  return a + c;
}

//------------------------------------------------------------------------------------
// template 模板关键字
// typename 关键字,可用 class,二者功能一样   eg:template<class T>
// T,即通用类型名字,可以任意定义,abcdef都行
// 函数调用时,实参传递什么类型数据,T 就是相应的类型
//------------------------------------------------------------------------------------

int main() {
  int a = 1, b = 2;
  double c = 1.0, d = 2.0;
  int e = add(a, b);
  double f = add(c, d);
  std::cout << e << std::endl;
  std::cout << f << std::endl;
  return 0;
}

//------------------------------------------------------------------------------------
// 原理：
// 根据实参的类型,编译阶段会生成相应的重载函数
// 实际有2个add的具体函数,int add(int a, int c),double add(double a, double c)
// 所以本质上相当于重载，但是重载函数不需要我们自己书写，而是系统自动生成，这是极大方便与高效与准确
//------------------------------------------------------------------------------------

